###############################################################################
# Created by write_sdc
# Fri Aug 15 09:31:34 2025
###############################################################################
current_design axi_apb_bridge
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name axi_aclk -period 10.0000 [get_ports {axi_aclk}]
set_clock_transition 0.1500 [get_clocks {axi_aclk}]
set_clock_uncertainty 0.2500 axi_aclk
set_propagated_clock [get_clocks {axi_aclk}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[10]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[11]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[12]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[13]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[14]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[15]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[16]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[17]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[18]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[19]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[20]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[21]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[22]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[23]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[24]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[25]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[26]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[27]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[28]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[29]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[30]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[31]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[8]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_prdata[9]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pready}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pslverr}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[10]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[11]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[12]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[13]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[14]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[15]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[16]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[17]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[18]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[19]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[20]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[21]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[22]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[23]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[24]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[25]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[26]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[27]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[28]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[29]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[30]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[31]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[3]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[4]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[5]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[6]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[7]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[8]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_araddr[9]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_aresetn}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_arprot[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_arprot[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_arprot[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_arvalid}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[10]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[11]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[12]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[13]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[14]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[15]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[16]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[17]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[18]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[19]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[20]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[21]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[22]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[23]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[24]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[25]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[26]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[27]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[28]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[29]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[30]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[31]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[3]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[4]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[5]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[6]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[7]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[8]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awaddr[9]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awprot[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awprot[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awprot[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awvalid}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_bready}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rready}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[10]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[11]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[12]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[13]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[14]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[15]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[16]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[17]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[18]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[19]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[20]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[21]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[22]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[23]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[24]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[25]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[26]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[27]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[28]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[29]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[30]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[31]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[8]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wdata[9]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wstrb[0]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wstrb[1]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wstrb[2]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wstrb[3]}]
set_input_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wvalid}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[0]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[10]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[11]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[12]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[13]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[14]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[15]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[16]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[17]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[18]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[19]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[1]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[20]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[21]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[22]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[23]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[24]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[25]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[26]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[27]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[28]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[29]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[2]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[30]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[31]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[3]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[4]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[5]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[6]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[7]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[8]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_paddr[9]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_penable}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_psel}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[0]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[10]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[11]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[12]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[13]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[14]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[15]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[16]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[17]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[18]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[19]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[1]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[20]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[21]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[22]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[23]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[24]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[25]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[26]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[27]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[28]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[29]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[2]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[30]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[31]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[3]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[4]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[5]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[6]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[7]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[8]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwdata[9]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {apb_pwrite}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_arready}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_awready}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_bresp[0]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_bresp[1]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_bvalid}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[0]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[10]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[11]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[12]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[13]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[14]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[15]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[16]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[17]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[18]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[19]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[1]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[20]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[21]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[22]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[23]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[24]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[25]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[26]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[27]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[28]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[29]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[2]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[30]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[31]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[3]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[4]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[5]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[6]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[7]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[8]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rdata[9]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rresp[0]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rresp[1]}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_rvalid}]
set_output_delay 2.0000 -clock [get_clocks {axi_aclk}] -add_delay [get_ports {axi_wready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {apb_penable}]
set_load -pin_load 0.0334 [get_ports {apb_psel}]
set_load -pin_load 0.0334 [get_ports {apb_pwrite}]
set_load -pin_load 0.0334 [get_ports {axi_arready}]
set_load -pin_load 0.0334 [get_ports {axi_awready}]
set_load -pin_load 0.0334 [get_ports {axi_bvalid}]
set_load -pin_load 0.0334 [get_ports {axi_rvalid}]
set_load -pin_load 0.0334 [get_ports {axi_wready}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[31]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[30]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[29]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[28]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[27]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[26]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[25]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[24]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[23]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[22]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[21]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[20]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[19]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[18]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[17]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[16]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[15]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[14]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[13]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[12]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[11]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[10]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[9]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[8]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[7]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[6]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[5]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[4]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[3]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[2]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[1]}]
set_load -pin_load 0.0334 [get_ports {apb_paddr[0]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[31]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[30]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[29]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[28]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[27]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[26]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[25]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[24]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[23]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[22]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[21]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[20]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[19]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[18]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[17]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[16]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[15]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[14]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[13]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[12]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[11]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[10]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[9]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[8]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[7]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[6]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[5]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[4]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[3]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[2]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[1]}]
set_load -pin_load 0.0334 [get_ports {apb_pwdata[0]}]
set_load -pin_load 0.0334 [get_ports {axi_bresp[1]}]
set_load -pin_load 0.0334 [get_ports {axi_bresp[0]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[31]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[30]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[29]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[28]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[27]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[26]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[25]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[24]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[23]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[22]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[21]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[20]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[19]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[18]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[17]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[16]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[15]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[14]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[13]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[12]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[11]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[10]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[9]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[8]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {axi_rdata[0]}]
set_load -pin_load 0.0334 [get_ports {axi_rresp[1]}]
set_load -pin_load 0.0334 [get_ports {axi_rresp[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_pready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_pslverr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_aclk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_aresetn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_arvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_bready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_rready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {apb_prdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_araddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_arprot[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_arprot[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_arprot[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awaddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awprot[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awprot[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_awprot[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wstrb[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wstrb[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wstrb[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {axi_wstrb[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
